app/views/posts/_form.html.erb

    <%= f.label :category_ids %><br>
    <%= f.collection_check_boxes :category_ids, Category.all, :id, :name %>
---
SELECT "categories".* FROM "categories"