app/views/posts/show.html.erb

SELECT COUNT(*) FROM "favourite_posts" WHERE "favourite_posts"."post_id" = ?  [["post_id", 48]]
---
          <i class = "glyphicon glyphicon-star-empty"></i>
          <%= @post.favourite_posts.count %>