app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "good bay blog"], ["body", "good bay blog good bay blog"], ["post_id", 7], ["created_at", "2016-01-18 14:46:15.807433"], ["updated_at", "2016-01-18 14:46:15.807433"]]