app/controllers/posts_controller.rb

  def index
    @posts = Post.order(created_at: :desc).page(params[:page])
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
    @post = current_user.posts.create(post_params)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ssdaf"], ["body", "asfas"], ["created_at", "2016-01-15 14:37:46.763786"], ["updated_at", "2016-01-15 14:37:46.763786"]]

  def show
    @post.increment!(:page_views)
---
UPDATE "posts" SET "page_views" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["page_views", 1], ["updated_at", "2016-02-06 21:41:02.277810"], ["id", 43]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "testing blog!! testing blog!! testing blog!! testing blog!! "], ["updated_at", "2016-01-18 11:57:34.112162"], ["id", 7]]