app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."created_at" DESC LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.order(created_at: :desc).page(params[:page])

INSERT INTO "users" ("name", "lastname", "email", "avatar", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "password_salt" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_salt", "$2a$10$g4k7VQkwN6vEQ6ZmPnrTzu"], ["password_hash", "$2a$10$g4k7VQkwN6vEQ6ZmPnrTzuSCTIZdcvngl.kwAJY1cwGH4D7fUaDrS"], ["updated_at", "2016-01-30 23:10:13.220214"], ["id", 12]]
---
  def update
    if @user.update(user_params)

UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", "t"], ["updated_at", "2016-02-06 20:15:32.119434"], ["id", 15]]
---
  def change_permission
      @user.update(admin: !@user.admin)